# Country Club Analysis with SQL

Our new country club has been open for 3 months! It's time to analyze the data from our first quarter and evaulate the state of the business.

In [1]:
# Import packages

import pandas as pd
import sqlite3

In [339]:
# Connect to database

conn = sqlite3.connect("country_club_database.db")
cur = conn.cursor()

In [340]:
# View all tables in database

tables = cur.execute("SELECT name FROM sqlite_master WHERE type = 'table'").fetchall()

print(f'The following tables are in this database:')
for i in tables:
    print(i[0])

The following tables are in this database:
Bookings
Facilities
Members

Let's examine our  3 tables:

In [377]:
# The facilities table

query = ''' SELECT *
            FROM facilities;
        '''

df = pd.read_sql_query(query, conn)
df.style.hide_index()

There are a total of 9 facilities at the country club.

In [400]:
# The bookings table 

query = '''SELECT *
           FROM bookings;
        
        '''

df = pd.read_sql_query(query, conn)
df = df.head(20)  # returns summary of dataset 
df.style.hide_index()

Our booking data spans from July 3, 2012 through September 30, 2012.

In [334]:
# The members table 

query = '''SELECT *
           FROM members;
        '''

df = pd.read_sql_query(query, conn)
df.style.hide_index()

In [342]:
# Show member count 

query = '''SELECT COUNT(DISTINCT memid)
           FROM members
           WHERE memid != 0;
        '''

df = pd.read_sql_query(query, conn)
df.style.hide_index()

We have 30 members and allow for guest visits.

Now let's write some queries to produce datasets of interest.

In [425]:
# Total revenue and overall profitability for the July - September period 

query = ''' WITH rev_prof AS 
            (SELECT f.name AS facility,
            SUM(CASE WHEN bookings.memid != 0 THEN f.membercost * bookings.slots
    	            ELSE f.guestcost * bookings.slots END) AS revenue_per_fac,
            SUM(CASE WHEN bookings.memid != 0 THEN f.membercost * bookings.slots
    	            ELSE f.guestcost * bookings.slots END) - (monthlymaintenance * 3) - (initialoutlay) AS profit
            FROM facilities AS f
            INNER JOIN bookings ON f.facid = bookings.facid
            GROUP BY facility 
            ORDER BY profit DESC),

            expenses AS 
            (SELECT SUM(initialoutlay) AS total_outlay, SUM(monthlymaintenance * 3) AS total_maintenance
            FROM facilities)
            
            
            SELECT SUM(revenue_per_fac) AS total_revenue, 
                   total_outlay, total_maintenance, 
                   SUM(profit) AS total_profit
            FROM rev_prof,
                 expenses;
       '''

df = pd.read_sql_query(query, conn)
df.style.hide_index()

Overall, we've made a profit of $53,160! Not bad for the first 3 months.

In [418]:
# Examine the total revenue and profit for each facility for the period in question (July - Sep)
# Revenue minus monthly maintenance(times 3) & initial investment (initial outlay) = profit

query = ''' SELECT f.name AS facility,
            SUM(CASE WHEN bookings.memid != 0 THEN f.membercost * bookings.slots
    	            ELSE f.guestcost * bookings.slots END) AS revenue,
            f.initialoutlay AS initial_investment,   
            f.monthlymaintenance * 3 AS maintenance_for_period,     
            SUM(CASE WHEN bookings.memid != 0 THEN f.membercost * bookings.slots
    	            ELSE f.guestcost * bookings.slots END) - (monthlymaintenance * 3) - (initialoutlay) AS profit
            FROM Facilities AS f
            INNER JOIN bookings ON f.facid = bookings.facid
            GROUP BY facility 
            ORDER BY profit DESC;
        '''

df = pd.read_sql_query(query, conn)
df.style.hide_index()

The most profitable facilities are Massage Room 1, Squash Court and Tennis Court 2 for the time period noted.  In contrast, the facilities with the greatest loss for the time period are the Badminton Court, Snooker Table and Pool Table (in order of greatest to least). Contributors to loss in each of these facilities can be attributed to pricing for members and guests.  

Our steepest loss (by far) is the badminton court. This is because the initial investment was $ 4000 (the same as the massages rooms). However, it's free for members and only $15 for guests. Whereas the massage room is $10 for members and $80 for guests. The monthly maintenance for the badminton court is only $50 vs $3000 for the massage rooms, so we expect it to become profitable over time due to low mainatenance cost. However we may want to look into increasing the price.

Let's take a look at the average amount of bookings per member:

In [351]:
# The count of bookings divided by the count of unique member id's

query = ''' SELECT (COUNT(b.bookid) / COUNT(DISTINCT memid)) AS bookings_per_member
            FROM bookings AS b;
            
        '''


df = pd.read_sql_query(query, conn)
df.style.hide_index()

Let's calculate the revenue per member:

In [395]:
# Total revenue divided by total members 

query = ''' WITH revenue AS 
            (SELECT f.name AS facility,
            SUM(CASE WHEN bookings.memid != 0 THEN f.membercost * bookings.slots
    	            ELSE f.guestcost * bookings.slots END) AS revenue_per_fac
            FROM Facilities AS f
            INNER JOIN bookings ON f.facid = bookings.facid
            GROUP BY facility),

            member_count AS
            (SELECT COUNT(DISTINCT m.memid) AS mem
            FROM members AS m
            WHERE m.memid != 0 )

            SELECT (SUM(revenue_per_fac) /  mem)  AS revenue_per_member
            FROM revenue,
            member_count;
            
        '''

df = pd.read_sql_query(query, conn)
df.style.hide_index()

Let's calculate the revenue per booking:

In [404]:
# Total revenue divided by total bookings 

query = ''' WITH revenue AS 
            (SELECT f.name AS facility,
            SUM(CASE WHEN bookings.memid != 0 THEN f.membercost * bookings.slots
    	            ELSE f.guestcost * bookings.slots END) AS revenue_per_fac
            FROM Facilities AS f
            INNER JOIN bookings ON f.facid = bookings.facid
            GROUP BY facility),

            booking_count AS
            (SELECT COUNT(DISTINCT bookid) AS count_
            FROM bookings)

            SELECT (SUM(revenue_per_fac) / count_) AS revenue_per_booking
            FROM revenue,
            booking_count;
            
        '''

df = pd.read_sql_query(query, conn)
df.style.hide_index()

Excellent! 

We are making $3,634 per member and $27 per booking.

Now that we've examined our revenue/profit, let's make some more inquiries:

In [93]:
# We are considering making some design changes to the the tennis courts. 
# Let's produce a list of all members who have used a tennis court to send out a phone survey. 

query = '''SELECT DISTINCT m.firstname || ' ' || m.surname AS name,
                  m.telephone AS contact,
		          Facilities.name AS facility
            FROM Members AS m 
            JOIN Bookings ON m.memid = Bookings.memid
            JOIN Facilities ON Facilities.facid = Bookings.facid
            WHERE Facilities.name LIKE 'Tennis%' AND m.firstname NOT LIKE 'Guest%'
            GROUP BY m.firstname
            ORDER BY name;
        '''


df = pd.read_sql_query(query, conn)
df.style.hide_index()

In [142]:
# We would like to send out appreciation cards to members who have recommended others who in turn became new members!
# Let's produce a report of members and those who recommended them in alphabetical order

query = '''SELECT m.firstname || ' ' || m.surname AS 'new member',
		  m1.firstname || ' ' || m1.surname AS 'recommended by',
                  m1.address 
           FROM Members as m
           INNER JOIN Members as m1 
           ON m.recommendedby = m1.memid
           WHERE m1.memid != 0
           ORDER BY m.surname, m.firstname;
        '''

df = pd.read_sql_query(query, conn)
df.style.hide_index()

In [237]:
# We would like to find the most popular facilities amongst our members
# Let's produce a list of the facilities with their total usage (booking count) over the 3 month period (guests not included)

query = ''' SELECT f.name AS 'Name', 
                   b.total AS Booking_count
            FROM Facilities AS f
            LEFT JOIN (SELECT facid, COUNT(bookid) AS total
            FROM Bookings AS b
            WHERE memid != 0
            GROUP BY facid) AS b 
            ON f.facid = b.facid
            ORDER BY Booking_count DESC;
        '''


df = pd.read_sql_query(query, conn)
df.style.hide_index()

In [408]:
# Now let's find the most popular facilities amongst our members per month!

query = ''' SELECT CASE WHEN strftime('%m', b.starttime) = '07' THEN 'July'
                        WHEN strftime('%m', b.starttime) = '08' THEN 'August'
                        ELSE 'September' END AS Month, 
                    f.name AS Facility, 
                    COUNT(b.slots) AS Monthly_Usage
            FROM Bookings AS b
            LEFT JOIN Facilities AS f 
            ON f.facid = b.facid
            WHERE b.memid != 0      
            GROUP BY f.name, month 
            ORDER BY strftime('%m', b.starttime), Monthly_Usage DESC;
        '''


df = pd.read_sql_query(query, conn)
df.style.hide_index()

The Pool Tabel is consistently the most popular facility. This might be due to its low cost, popularity as a game, and the ability for people to socialize while playling.

In [409]:
# Let's view all bookings for September 14 where the booking cost was over $30

query = ''' SELECT b.bookid,
                   firstname || ' ' || surname AS Name,
                   f.name AS facility,
            CASE WHEN b.memid = 0 THEN f.guestcost * b.slots
                 ELSE f.membercost * b.slots END AS cost_of_booking
            FROM bookings AS b 
            JOIN facilities AS f ON b.facid = f.facid
            JOIN members AS m ON b.memid = m.memid
            WHERE b.starttime LIKE '2012-09-14%' AND cost_of_booking > 30
            ORDER BY cost_of_booking DESC;
        '''


df = pd.read_sql_query(query, conn)
df.style.hide_index()

On any given day, our guests pay more for services. This is simply because the pricing is significantly higher for non-members.